win_state = False
counter = 0
player = ""
playing_field = list(range(1,10))

#Кортеж кортежей. Индексы как у родителя, так и у ребёнка. 
#Т.е. в условии цикла можно вытащить дочерний элемент, сославшись на индекс родительского. 
#А в теле цикла вытащить эллемент эллемента через его индекс.
all_win_coords = ((0, 1, 2), (3, 4, 5), (6, 7, 8), (0, 3, 6), 
                  (1, 4, 7), (2, 5, 8), (0, 4, 8), (6, 4, 2))

# all_win_coords = ((1, 2, 3), (4, 5, 6), (7, 8, 9), (1, 4, 7),
#                   (2, 5, 8), (3, 6, 9), (1, 5, 9), (7, 5, 3))

while win_state == False:
    if counter % 2 == 0: #Получаем остаток от деления и сравниваем его с нулём.
        player = "O"
    else:
        player = "X"
    print(f"\nХод игрока {player}\n")

#цикл ниже берёт из диапазона индексы так, чтобы 1-я строчка была неизменной, 
#во 2-й был индекс 3, 4, 5, 
#а в 3-й - 6, 7, 8
    
    for step in range(0,9,3): 
        print("|", playing_field[step],  #лучше исп. обычное перечисление агрументов, 
              "|", playing_field[step + 1], #чем ф-строку, т.к. она не позволяет нормально сделать разбитие
              "|", playing_field[step + 2], "|") #на короткие строчки в многострочном вводе.
    
    position = int(input(f"\nИгрок {player}, куда хотите сделать ход? (от 1 до 9)"))
    if position < 1 or position > 9:
        print("Вероятно вы опечатались. На поле нет ячейки с таким номером")
    elif position not in playing_field: #так не приходится создавать отдельные переменные 
        print("Такой ход уже был!") #для повтора хода при ошибочной постановке
    else:
        playing_field[position - 1] = player
        counter += 1
        print("Отладочный принт. Счётчик:", counter)
        if counter == 9: #проверка ничьей
            print("Победила дружба!")
            win_state = True
        elif counter > 4: 
            for unit in all_win_coords: #берём элемент кортежа кортежей
                print("Отладочный принт. Элемент кортежа:", unit)
                print("Отладочный принт. Сравнение элементов:", 
                                                           playing_field[unit[0]], #список[через индекс берём значение элемента кортежа кортежей, и это значение используем как индекс для списка]
                                                           playing_field[unit[1]],
                                                           playing_field[unit[2]])
                if playing_field[unit[0]] == playing_field[unit[1]] == playing_field[unit[2]]: #проверка победы. 
                    win_state = True
                    print(f"Игрок {player} - вы победили!")
                    break
