questions_list = ["""
Вот твой первый вопрос:

Кто был первым президентом России?
1. Путин Владимир Владимирович
2. Ельцин Борис Николавич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""",
"""
Твой второй вопрос:

Чему в Туле установлен памятник?
1. Хлебу
2. Кексу
3. Бублику
4. Прянику""",
"""
Итак... Твой третий вопрос:

Чего не ела героиня сказки «Гуси-лебеди», когда спасалась с братцем от погони?
1. Пирожок
2. Фуа-гра
3. Кисель
4. Яблоко""",
"""
И переходим к четвёртому вопросу:

Что обычно едят горячим?
1. Окрошку
2. Гаспачо
3. Рассольник
4. Свекольник""",
"""
Вопрос номер пять:
                
Что Китай недавно объявил своим национальным достоянием, вызвав возмущение граждан Южной Кореи?
1. Онигири
2. Кимчи
3. Ушу
4. Группу «BTS»""",
"""Итак... Шестой вопрос сегодняшней игры:
                    
Какой ингредиент знаменитой пиццы «Маргарита» не символизирует ни один из цветов флага Италии?
1. Оливковое масло
2. Томаты
3. Моцарелла
4. Базилик""",
"""
Твой седьмой вопрос:

В блюде немецкой кухни «Небо и земля» картофель — это земля. А что символизирует небеса?
1. Грибы
2. Петрушка
3. Яблоки
4. Клубника""",
"""
Продолжаем... Твой восьмой вопрос:

Какое блюдо создал французский повар Андре Дюпон, состоявший на службе у русского графа?
1. Бефстроганов
2. Цыпленок табака
3. Шницель по-венски
4. Ростбиф""",
"""
И переходим к девятому вопросу:

Неправильное написание какого слова объясняется тем, что мода на блюдо пришла не из Японии, а из Европы?
1. Тэмпура
2. Рамэн
3. Суши
4. Гедза""",
"""
Финальный, десятый вопрос:
                
Что стало популярным благодаря «Ресторану трех корон», обслуживавшему посетителей Всемирной выставки 1939 года?
1. Коктейли
2. Фастфуд
3. Шведский стол
4. Еда на вынос"""          
]